recipes = {
    0 : {
        'title': 'Абон',
        'ingredients': [
            ('Мясо', 500, 360, 760),
            ('Курятина', 300, 160, 450),
            ('Рыба', 150, 130, 800),
            ('Кокосовое молоко', 5, 3, 290),
            ('Грибы', 30, 16, 130)
        ]
    },
    1 : {
        'title': 'Воппер',
        'ingredients': [
            ('Булочка с кунжутом', 100, 80, 60),
            ('Котлета', 300, 160, 120),
            ('Огурец', 20, 15, 40),
            ('Помидор', 30, 25, 35),
            ('Кетчуп', 10, 7, 30)
        ]
    }
}

def get_recipes():
    return recipes

def get_recipe(id : int):
    return recipes.get(id, None)